// // 함수 파라미터를 두 개 받는 상황
// function showMessage(name, text) {
//     name = "*" + name + "*";
//     console.log(name + ': ' + text);
// }

// let name = 'seongdae';
// showMessage(name, '하이!');
// -----------------------------------------------------------------------------------------------------------------------

// 함수 리턴 시키기
// function checkAge(age) {
//     if (age < 20) {
//         alert('부모님 허락은 받았습니까?');
//     } else {
//         return true;
//     }
// }

// let age = prompt('나이를 알려주세요' , 18);

// if (checkAge(age)) {
//     alert('인정');
// } else {
//     alert('불합');
// }
// -----------------------------------------------------------------------------------------------------------------------

// 화살표 함수
// let double = n => n * 2;

// alert(double(3));
// -----------------------------------------------------------------------------------------------------------------------

// let hello = () => alert('Hello');

// hello();

// -----------------------------------------------------------------------------------------------------------------------

// function ask(question, yes, no) {
//     if (confirm(question)) yes()
//     else no();
// }

// ask(
//     '동의',
//     function() { alert('동의');},
//     function() { alert('비동의');}
// );

// 위의 결과를 축소한 결과가 아래와 같다.

// function ask(question, yes, no) {
//     if (confirm(question)) yes()
//     else no();
// }

// ask(
//     '동의?',
//     () => alert('동의!'),
//     () => alert('비동의!')
// );
// -----------------------------------------------------------------------------------------------------------------------

